In [70]:
import pandas as pd
import numpy as np

In [55]:
data = pd.read_csv ('adult.data')
data.head()

,Unnamed: 0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [56]:
data.columns

Index(['Unnamed: 0', '39', ' State-gov', ' 77516', ' Bachelors', ' 13',
       ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male',
       ' 2174', ' 0', ' 40', ' United-States', ' <=50K'],
      dtype='object')

In [50]:
data.index

RangeIndex(start=0, stop=32560, step=1)

In [51]:
data.values

array([[0, 50, ' Self-emp-not-inc', ..., 13, ' United-States', ' <=50K'],
       [1, 38, ' Private', ..., 40, ' United-States', ' <=50K'],
       [2, 53, ' Private', ..., 40, ' United-States', ' <=50K'],
       ...,
       [32557, 58, ' Private', ..., 40, ' United-States', ' <=50K'],
       [32558, 22, ' Private', ..., 20, ' United-States', ' <=50K'],
       [32559, 52, ' Self-emp-inc', ..., 40, ' United-States', ' >50K']],
      dtype=object)

In [52]:
data.shape

(32560, 16)

In [85]:
#checking for NaN's
df_c2.isnull()

       Education Level   Race    Sex  Native-Country  Income
0                False  False  False           False   False
1                False  False  False           False   False
2                False  False  False           False   False
3                False  False  False           False   False
4                False  False  False           False   False
...                ...    ...    ...             ...     ...
32555            False  False  False           False   False
32556            False  False  False           False   False
32557            False  False  False           False   False
32558            False  False  False           False   False
32559            False  False  False           False   False

[32560 rows x 5 columns]